//---------------------------------------------------------------------------
//目的：制作静态的片头窗口SplashScreen
//片头窗口显示与删除程序代码，请见母窗口Project1.cpp中Form1窗口打开
//---------------------------------------------------------------------------
#include <vcl.h>
#pragma hdrstop

#include "Unit1.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
    : TForm(Owner)
{
}
//---------------------------------------------------------------------------
